#1. Використовуючи функцію print, надрукувати фразу “I love Python” 42 рази.

print('I love Python' * 42)

#2. Створити змінну age_in_month, надавши їй значення вашого поточного віку в місяцях.

age_in_month = 289

#3. Створити змінну age_in_years, в яку записати ваш вік в роках на основі попередньої змінної.

age_in_years = age_in_month // 12
print(age_in_years)

#4. Створити змінну my_age, яка буде містити рядок “Му name is … I’m … years old”, де на замість пропусків буде
# підставлятись ваші імʼя та вік. Значення віку слід брати зі змінної age_in_years.

my_name = 'Dmytrii'
my_age = f"My name is {my_name}.\nI'm {age_in_years} years old."
print(my_age)

#5. Створити змінну зі значенням 1. Використовуючи оператори порівняння, порівняти її із будь-якими іншими значеннями
#(мінімум 5 порівнянь) і перевірити вивід в інтерпретаторі.

numb = 1

print(f"1 < 3: {numb < 3}\n"
      f"1 > 2: {numb > 2}\n"
      f"1 <= 1: {numb <= 1}\n"
      f"1 > 0: {numb >= 0}\n"
      f"1 == 1: {numb == 1}\n"
      f"1 != 0: {numb != 0}")

#6. Створити змінні a=2, b=5, c=6. На основі цих змінних створити змінну d, значення якої має бути “256”.

a = 2
b = 5
c = 6
d = str(a) + str(b) + str(c) #Якщо я добре зрозумів, то значення "256" повинно бути типу string.
print(d)
print(type(d))

#Ну, або так, наприклад:

def str_sum(*args):

    d = str(a) + str(b) + str(c)

    return d

print(str_sum(a, b, c))


